content/README.org
#+TITLE: My Emacs Configuration
#+AUTHOR: Malcolm Kahora

* Initial Start Up
** Remove Scroolbar
   #+begin_src emacs-lisp

     (scroll-bar-mode -1)

   #+end_src
** Remove tool bar
   #+begin_src emacs-lisp

     (tool-bar-mode -1)


   #+end_src
** Remove tooltip mode
   #+begin_src emacs-lisp

     (tooltip-mode -1)

   #+end_src
** Add margin
   #+begin_src emacs-lisp

(set-fringe-mode 50)

   #+end_src
** Remove menu-bar
   #+begin_src emacs-lisp

(menu-bar-mode -1)

   #+end_src
* General Set Up
** Registers
   #+begin_src emacs-lisp


; registers
(set-register ?i (cons 'file "/home/malcolm2/.emacs.d/README.org"))
(set-register ?l (cons 'file "/mnt/c/Home/SophmoreYear_Fall/Linear_Algebra_Homework/labs/"))
(set-register ?t (cons 'file "c:/Users/mango/AppData/Local/Packages/Microsoft.WindowsTerminal_8wekyb3d8bbwe/LocalState/"))


   #+end_src
** KeyBings
#+begin_src emacs-lisp

  (org-babel-load-file
   (expand-file-name "macros.el"
    user-emacs-directory))

#+end_src
* use-package
** contacts package hosts
   #+begin_src emacs-lisp


(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))



   #+end_src
** Initializes packages
   
   #+begin_src emacs-lisp


(package-initialize)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))


   #+end_src

* Packages
** Ivy
*** Main Ivy Config
    #+begin_src emacs-lisp


(use-package ivy
  :diminish                           ;; gets rid of bottom mode name
  :ensure t
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map     ;; use key bindings during certain modes
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :init
  (ivy-mode 1)) ;; uses ivy mode and default key bindings such as +b



    #+end_src
*** Ivy Rich
Adds rich descriptions to functions in minibuffer
#+begin_src emacs-lisp

(use-package ivy-rich
  :ensure t
  :init
  (ivy-rich-mode 1))


#+end_src
** Magit
   #+begin_src emacs-lisp


(use-package magit

  :ensure t  
  ; replace current window with magit
  :custom (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
  :config
  :bind (("C-x g" . magit)))


   #+end_src

** Counsel
   #+begin_src emacs-lisp

(use-package counsel
  :ensure t
  :bind (("M-x" . counsel-M-x)
	 ("C-x b" . counsel-ibuffer)
	 ("C-x C-f" . counsel-find-file)
	 :map minibuffer-local-map
	 ("C-r" . 'counsel-minibuffer-history)))

   #+end_src

