public/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Emacs Configuration</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">My Emacs Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4c9bf21">Initial Start Up</a>
<ul>
<li><a href="#org4985f71">Remove Scroolbar</a></li>
<li><a href="#org51bbf7c">Remove tool bar</a></li>
<li><a href="#org942ec68">Remove tooltip mode</a></li>
<li><a href="#orgfa3eab0">Add margin</a></li>
<li><a href="#org3982d6e">Remove menu-bar</a></li>
</ul>
</li>
<li><a href="#orgd4e25e7">General Set Up</a>
<ul>
<li><a href="#org981747b">Registers</a></li>
<li><a href="#org9e837d5">KeyBings</a></li>
</ul>
</li>
<li><a href="#org92c5d5d">use-package</a>
<ul>
<li><a href="#org53ca5d3">contacts package hosts</a></li>
<li><a href="#org75a918c">Initializes packages</a></li>
</ul>
</li>
<li><a href="#orge6142b9">Packages</a>
<ul>
<li><a href="#org1645f9d">Ivy</a>
<ul>
<li><a href="#org85fa8f5">Main Ivy Config</a></li>
<li><a href="#org040b996">Ivy Rich</a></li>
</ul>
</li>
<li><a href="#orgbbfa99d">Magit</a></li>
<li><a href="#org4e1f321">Counsel</a></li>
<li><a href="#org888be7d">Helpful</a></li>
<li><a href="#org63bd61e">yasnippet</a></li>
</ul>
</li>
<li><a href="#org3846414">Buffer Management</a>
<ul>
<li><a href="#orge0b9fcc">Ibuffer</a></li>
</ul>
</li>
<li><a href="#orga717654">Window Manager</a>
<ul>
<li><a href="#org38b4b87">Ace</a></li>
</ul>
</li>
<li><a href="#orgd25394c">Themes</a>
<ul>
<li><a href="#orgda46a3f">gruv-box</a></li>
<li><a href="#org67e98a3">All the icons</a></li>
<li><a href="#orgc6e4a1a">require theme</a></li>
</ul>
</li>
<li><a href="#orgf328144">UI</a>
<ul>
<li><a href="#org12a8325">Doom mode line</a></li>
<li><a href="#org36230ee">Rainbow Delimiters</a></li>
</ul>
</li>
<li><a href="#orgead4e56">Org</a>
<ul>
<li><a href="#org14ee309">General Set Up</a>
<ul>
<li><a href="#org9b0baa6">Custom Size</a></li>
<li><a href="#orgc8c325a">Org start up</a></li>
</ul>
</li>
<li><a href="#org2663205">Global Bindings</a></li>
<li><a href="#org58b20e0">Org capture templates</a></li>
<li><a href="#org5741608">Org-bullets</a></li>
<li><a href="#org6ab1906">Org Roam</a>
<ul>
<li><a href="#org1301583">Initial package</a></li>
</ul>
</li>
<li><a href="#orgf7d9253">Org Babel</a>
<ul>
<li><a href="#orgbe3dcf8">Structure Templates</a></li>
</ul>
</li>
<li><a href="#org2b879c4">Org gcal</a></li>
</ul>
</li>
<li><a href="#org95ed927"><span class="todo TODO">TODO</span> MatLab</a>
<ul>
<li><a href="#orgd060ea6">Mode</a></li>
</ul>
</li>
<li><a href="#org04b9691">Terminals</a>
<ul>
<li><a href="#orgbf614b3">term</a>
<ul>
<li><a href="#org9c6f207">term-mode color</a></li>
</ul>
</li>
<li><a href="#orgac95e6d">Ansi term</a></li>
<li><a href="#org2165bef">Vterm</a></li>
<li><a href="#orgbd30d55">eshell</a>
<ul>
<li><a href="#orgc8e04ea">Eshell configuring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org46ead44">website-publishing</a>
<ul>
<li><a href="#orgca1d537">local host</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4c9bf21" class="outline-2">
<h2 id="org4c9bf21">Initial Start Up</h2>
<div class="outline-text-2" id="text-org4c9bf21">
</div>
<div id="outline-container-org4985f71" class="outline-3">
<h3 id="org4985f71">Remove Scroolbar</h3>
<div class="outline-text-3" id="text-org4985f71">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(scroll-bar-mode -1)

</pre>
</div>
</div>
</div>
<div id="outline-container-org51bbf7c" class="outline-3">
<h3 id="org51bbf7c">Remove tool bar</h3>
<div class="outline-text-3" id="text-org51bbf7c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(tool-bar-mode -1)


</pre>
</div>
</div>
</div>
<div id="outline-container-org942ec68" class="outline-3">
<h3 id="org942ec68">Remove tooltip mode</h3>
<div class="outline-text-3" id="text-org942ec68">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(tooltip-mode -1)

</pre>
</div>
</div>
</div>
<div id="outline-container-orgfa3eab0" class="outline-3">
<h3 id="orgfa3eab0">Add margin</h3>
<div class="outline-text-3" id="text-orgfa3eab0">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(set-fringe-mode 50)

</pre>
</div>
</div>
</div>
<div id="outline-container-org3982d6e" class="outline-3">
<h3 id="org3982d6e">Remove menu-bar</h3>
<div class="outline-text-3" id="text-org3982d6e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(menu-bar-mode -1)

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd4e25e7" class="outline-2">
<h2 id="orgd4e25e7">General Set Up</h2>
<div class="outline-text-2" id="text-orgd4e25e7">
</div>
<div id="outline-container-org981747b" class="outline-3">
<h3 id="org981747b">Registers</h3>
<div class="outline-text-3" id="text-org981747b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">registers</span>
(set-register ?i (cons 'file <span style="font-style: italic;">"/home/malcolm2/.emacs.d/README.org"</span>))
(set-register ?l (cons 'file <span style="font-style: italic;">"/mnt/c/Home/SophmoreYear_Fall/Linear_Algebra_Homework/labs/"</span>))
(set-register ?t (cons 'file <span style="font-style: italic;">"c:/Users/mango/AppData/Local/Packages/Microsoft.WindowsTerminal_8wekyb3d8bbwe/LocalState/"</span>))


</pre>
</div>
</div>
</div>
<div id="outline-container-org9e837d5" class="outline-3">
<h3 id="org9e837d5">KeyBings</h3>
<div class="outline-text-3" id="text-org9e837d5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(org-babel-load-file
 (expand-file-name <span style="font-style: italic;">"macros.el"</span>
  user-emacs-directory))

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org92c5d5d" class="outline-2">
<h2 id="org92c5d5d">use-package</h2>
<div class="outline-text-2" id="text-org92c5d5d">
</div>
<div id="outline-container-org53ca5d3" class="outline-3">
<h3 id="org53ca5d3">contacts package hosts</h3>
<div class="outline-text-3" id="text-org53ca5d3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">package</span>)

(<span style="font-weight: bold;">setq</span> package-archives '((<span style="font-style: italic;">"melpa"</span> . <span style="font-style: italic;">"https://melpa.org/packages/"</span>)
                         (<span style="font-style: italic;">"org"</span> . <span style="font-style: italic;">"https://orgmode.org/elpa/"</span>)
                         (<span style="font-style: italic;">"elpa"</span> . <span style="font-style: italic;">"https://elpa.gnu.org/packages/"</span>)))



</pre>
</div>
</div>
</div>
<div id="outline-container-org75a918c" class="outline-3">
<h3 id="org75a918c">Initializes packages</h3>
<div class="outline-text-3" id="text-org75a918c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

(package-initialize)

(<span style="font-weight: bold;">unless</span> (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge6142b9" class="outline-2">
<h2 id="orge6142b9">Packages</h2>
<div class="outline-text-2" id="text-orge6142b9">
</div>
<div id="outline-container-org1645f9d" class="outline-3">
<h3 id="org1645f9d">Ivy</h3>
<div class="outline-text-3" id="text-org1645f9d">
</div>
<div id="outline-container-org85fa8f5" class="outline-4">
<h4 id="org85fa8f5">Main Ivy Config</h4>
<div class="outline-text-4" id="text-org85fa8f5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

(use-package ivy
  <span style="font-weight: bold;">:diminish</span>                           <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">gets rid of bottom mode name</span>
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-s"</span> . swiper)
         <span style="font-weight: bold;">:map</span> ivy-minibuffer-map     <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">use key bindings during certain modes</span>
         (<span style="font-style: italic;">"TAB"</span> . ivy-alt-done)
         (<span style="font-style: italic;">"C-l"</span> . ivy-alt-done)
         (<span style="font-style: italic;">"C-j"</span> . ivy-next-line)
         (<span style="font-style: italic;">"C-k"</span> . ivy-previous-line)
         <span style="font-weight: bold;">:map</span> ivy-switch-buffer-map
         (<span style="font-style: italic;">"C-k"</span> . ivy-previous-line)
         (<span style="font-style: italic;">"C-l"</span> . ivy-done)
         (<span style="font-style: italic;">"C-d"</span> . ivy-switch-buffer-kill)
         <span style="font-weight: bold;">:map</span> ivy-reverse-i-search-map
         (<span style="font-style: italic;">"C-k"</span> . ivy-previous-line)
         (<span style="font-style: italic;">"C-d"</span> . ivy-reverse-i-search-kill))
  <span style="font-weight: bold;">:init</span>
  (ivy-mode 1)) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">uses ivy mode and default key bindings such as &#24;+b</span>



</pre>
</div>
</div>
</div>
<div id="outline-container-org040b996" class="outline-4">
<h4 id="org040b996">Ivy Rich</h4>
<div class="outline-text-4" id="text-org040b996">
<p>
Adds rich descriptions to functions in minibuffer
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package ivy-rich
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span>
  (ivy-rich-mode 1))


</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbbfa99d" class="outline-3">
<h3 id="orgbbfa99d">Magit</h3>
<div class="outline-text-3" id="text-orgbbfa99d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

(use-package magit

  <span style="font-weight: bold;">:ensure</span> t  
  <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">replace current window with magit</span>
  <span style="font-weight: bold;">:custom</span> (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-x g"</span> . magit)))


</pre>
</div>
</div>
</div>

<div id="outline-container-org4e1f321" class="outline-3">
<h3 id="org4e1f321">Counsel</h3>
<div class="outline-text-3" id="text-org4e1f321">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package counsel
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"M-x"</span> . counsel-M-x)
         (<span style="font-style: italic;">"C-x b"</span> . counsel-ibuffer)
         (<span style="font-style: italic;">"C-x C-f"</span> . counsel-find-file)
         <span style="font-weight: bold;">:map</span> minibuffer-local-map
         (<span style="font-style: italic;">"C-r"</span> . 'counsel-minibuffer-history)))

</pre>
</div>
</div>
</div>
