content/README.org
** Helpful

This is just better help buffers when using C-h
   
   #+begin_src emacs-lisp


(use-package helpful
  :ensure t
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))


   #+end_src

** yasnippet
   This package is great for creating small text shortcuts for common words or expressions
   #+begin_src emacs-lisp


(use-package yasnippet
  :ensure t
  :init
  :config (use-package yasnippet-snippets
	    :ensure t)
  (yas-reload-all))

; these hooks enable yas based onw hat mode you in

(add-hook 'org-mode-hook #'yas-minor-mode)
(add-hook 'org-roam-mode-hook 'yas-minor-mode)
(add-hook 'c++-mode-hook 'yas-minor-mode)
(add-hook 'emacs-lisp-mode-hook 'yas-minor-mode)

   #+end_src

* Buffer Management
  
** Ibuffer
   #+begin_src emacs-lisp

(global-set-key (kbd "C-x C-b") 'ibuffer)

   #+end_src
* Window Manager
** Ace
   #+begin_src emacs-lisp

  
(use-package ace-window
  :ensure t
  :init
  (progn
    (global-set-key [remap other-window] 'ace-window)
    (custom-set-faces
     '(aw-leading-char-face
       ((t (:inherit ace-jump-face-foreground :height 3.0 :foreground "blue")))))
    ))




   #+end_src
* Themes
** gruv-box
   #+begin_src emacs-lisp


(use-package gruvbox-theme
  :ensure t)


   #+end_src
** All the icons
   #+begin_src emacs-lisp


(use-package all-the-icons
  :ensure t)

   #+end_src
** require theme
   #+begin_src emacs-lisp

(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(custom-enabled-themes '(gruvbox-light-soft))
 '(custom-safe-themes
   '("4eb6fa2ee436e943b168a0cd8eab11afc0752aebb5d974bba2b2ddc8910fca8f" default)))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )


   #+end_src
* UI
** Doom mode line
   #+begin_src emacs-lisp


     (use-package doom-modeline
       :ensure t
       :init (doom-modeline-mode 1)
       :custom ((doom-modeline-height 10)))


   #+end_src
** Rainbow Delimiters
   Nice rainbow matching parenthesis
   #+begin_src emacs-lisp

     (use-package rainbow-delimiters
       :ensure t
       :hook (prog-mode . rainbow-delimiters-mode))


   #+end_src
* Org  
** General Set Up
#+begin_src emacs-lisp


	  (use-package org
	    :ensure t
	      :hook (org-mode . dw/org-mode-setup)
	    :config
	    (setq org-ellipsis " ▾"
		  org-hide-emphasis-markers t)

	    (setq org-agenda-files
	'("/mnt/c/Home/OrgAgenda/tasks.org"
	  "/mnt/c/Home/OrgAgenda/birthdays.org"
	  "/mnt/c/Home/OrgAgenda/Homework.org"
	  "/mnt/c/Home/OrgAgenda/Events.org"))
)


   #+end_src

*** Custom Size
    This inhibits org mode images not scaling
    #+begin_src emacs-lisp



(setq org-image-actual-width nil)



    #+end_src

*** Org start up
    Custom function for some org files cleaning and formating
    #+begin_src emacs-lisp
(defun dw/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))

    #+end_src
** Global Bindings
   #+begin_src emacs-lisp

(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)

   #+end_src  
** Org capture templates

A few templates I use which work well with org-gcal

#+begin_src emacs-lisp

(setq org-capture-templates
      '(("t" "Todo" entry (file "/mnt/c/Home/OrgAgenda/Tasks.org")
	 "* TODO %^{Task}\n:PROPERTIES:\n:END:\n:org-gcal:\nSCHEDULED: %^{When to do}t\n:END:")

	("e" "Event" entry (file "/mnt/c/Home/OrgAgenda/Events.org")
	 "* %^{Event name}\n :PROPERTIES:\n:END:\n:org-gcal:\n%^{When}t\n:END:")
	
      ("h" "Homework" entry (file "/mnt/c/Home/OrgAgenda/Homework.org")
	 "* %^{Description} - %^{Class|Creative Design |Analysis of Algorithims |Computer Architecture |Linear Algebra|199 Seminar }\n :PROPERTIES:\n:END:\n:org-gcal:\nSCHEDULED: %^{Due Date}t \n:END:")))

#+end_src
