public/README.html

<div id="outline-container-org888be7d" class="outline-3">
<h3 id="org888be7d">Helpful</h3>
<div class="outline-text-3" id="text-org888be7d">
<p>
This is just better help buffers when using C-h
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">

(use-package helpful
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:custom</span>
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  <span style="font-weight: bold;">:bind</span>
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))


</pre>
</div>
</div>
</div>

<div id="outline-container-org63bd61e" class="outline-3">
<h3 id="org63bd61e">yasnippet</h3>
<div class="outline-text-3" id="text-org63bd61e">
<p>
This package is great for creating small text shortcuts for common words or expressions
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">

(use-package yasnippet
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span>
  <span style="font-weight: bold;">:config</span> (use-package yasnippet-snippets
            <span style="font-weight: bold;">:ensure</span> t)
  (yas-reload-all))

<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">these hooks enable yas based onw hat mode you in</span>

(add-hook 'org-mode-hook #'yas-minor-mode)
(add-hook 'org-roam-mode-hook 'yas-minor-mode)
(add-hook 'c++-mode-hook 'yas-minor-mode)
(add-hook 'emacs-lisp-mode-hook 'yas-minor-mode)

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3846414" class="outline-2">
<h2 id="org3846414">Buffer Management</h2>
<div class="outline-text-2" id="text-org3846414">
</div>
<div id="outline-container-orge0b9fcc" class="outline-3">
<h3 id="orge0b9fcc">Ibuffer</h3>
<div class="outline-text-3" id="text-orge0b9fcc">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(global-set-key (kbd <span style="font-style: italic;">"C-x C-b"</span>) 'ibuffer)

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga717654" class="outline-2">
<h2 id="orga717654">Window Manager</h2>
<div class="outline-text-2" id="text-orga717654">
</div>
<div id="outline-container-org38b4b87" class="outline-3">
<h3 id="org38b4b87">Ace</h3>
<div class="outline-text-3" id="text-org38b4b87">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

(use-package ace-window
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span>
  (<span style="font-weight: bold;">progn</span>
    (global-set-key [remap other-window] 'ace-window)
    (custom-set-faces
     '(aw-leading-char-face
       ((t (<span style="font-weight: bold;">:inherit</span> ace-jump-face-foreground <span style="font-weight: bold;">:height</span> 3.0 <span style="font-weight: bold;">:foreground</span> <span style="font-style: italic;">"blue"</span>)))))
    ))




</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd25394c" class="outline-2">
<h2 id="orgd25394c">Themes</h2>
<div class="outline-text-2" id="text-orgd25394c">
</div>
<div id="outline-container-orgda46a3f" class="outline-3">
<h3 id="orgda46a3f">gruv-box</h3>
<div class="outline-text-3" id="text-orgda46a3f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

(use-package gruvbox-theme
  <span style="font-weight: bold;">:ensure</span> t)


</pre>
</div>
</div>
</div>
<div id="outline-container-org67e98a3" class="outline-3">
<h3 id="org67e98a3">All the icons</h3>
<div class="outline-text-3" id="text-org67e98a3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

(use-package all-the-icons
  <span style="font-weight: bold;">:ensure</span> t)

</pre>
</div>
</div>
</div>
<div id="outline-container-orgc6e4a1a" class="outline-3">
<h3 id="orgc6e4a1a">require theme</h3>
<div class="outline-text-3" id="text-orgc6e4a1a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(custom-set-variables
 <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">custom-set-variables was added by Custom.</span>
 <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">If you edit it by hand, you could mess it up, so be careful.</span>
 <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Your init file should contain only one such instance.</span>
 <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">If there is more than one, they won't work right.</span>
 '(custom-enabled-themes '(gruvbox-light-soft))
 '(custom-safe-themes
   '(<span style="font-style: italic;">"4eb6fa2ee436e943b168a0cd8eab11afc0752aebb5d974bba2b2ddc8910fca8f"</span> default)))
(custom-set-faces
 <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">custom-set-faces was added by Custom.</span>
 <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">If you edit it by hand, you could mess it up, so be careful.</span>
 <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Your init file should contain only one such instance.</span>
 <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">If there is more than one, they won't work right.</span>
 )


</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf328144" class="outline-2">
<h2 id="orgf328144">UI</h2>
<div class="outline-text-2" id="text-orgf328144">
</div>
<div id="outline-container-org12a8325" class="outline-3">
<h3 id="org12a8325">Doom mode line</h3>
<div class="outline-text-3" id="text-org12a8325">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

(use-package doom-modeline
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span> (doom-modeline-mode 1)
  <span style="font-weight: bold;">:custom</span> ((doom-modeline-height 10)))


</pre>
</div>
</div>
</div>
<div id="outline-container-org36230ee" class="outline-3">
<h3 id="org36230ee">Rainbow Delimiters</h3>
<div class="outline-text-3" id="text-org36230ee">
<p>
Nice rainbow matching parenthesis
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package rainbow-delimiters
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:hook</span> (prog-mode . rainbow-delimiters-mode))


</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgead4e56" class="outline-2">
<h2 id="orgead4e56">Org</h2>
<div class="outline-text-2" id="text-orgead4e56">
</div>
<div id="outline-container-org14ee309" class="outline-3">
<h3 id="org14ee309">General Set Up</h3>
<div class="outline-text-3" id="text-org14ee309">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

          (use-package org
            <span style="font-weight: bold;">:ensure</span> t
              <span style="font-weight: bold;">:hook</span> (org-mode . dw/org-mode-setup)
            <span style="font-weight: bold;">:config</span>
            (<span style="font-weight: bold;">setq</span> org-ellipsis <span style="font-style: italic;">" &#9662;"</span>
                  org-hide-emphasis-markers t)

            (<span style="font-weight: bold;">setq</span> org-agenda-files
        '(<span style="font-style: italic;">"/mnt/c/Home/OrgAgenda/tasks.org"</span>
          <span style="font-style: italic;">"/mnt/c/Home/OrgAgenda/birthdays.org"</span>
          <span style="font-style: italic;">"/mnt/c/Home/OrgAgenda/Homework.org"</span>
          <span style="font-style: italic;">"/mnt/c/Home/OrgAgenda/Events.org"</span>))
)


</pre>
</div>
</div>

<div id="outline-container-org9b0baa6" class="outline-4">
<h4 id="org9b0baa6">Custom Size</h4>
<div class="outline-text-4" id="text-org9b0baa6">
<p>
This inhibits org mode images not scaling
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">


(<span style="font-weight: bold;">setq</span> org-image-actual-width nil)



</pre>
</div>
</div>
</div>

<div id="outline-container-orgc8c325a" class="outline-4">
<h4 id="orgc8c325a">Org start up</h4>
<div class="outline-text-4" id="text-orgc8c325a">
<p>
Custom function for some org files cleaning and formating
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">dw/org-mode-setup</span> ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2663205" class="outline-3">
<h3 id="org2663205">Global Bindings</h3>
<div class="outline-text-3" id="text-org2663205">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(global-set-key (kbd <span style="font-style: italic;">"C-c l"</span>) 'org-store-link)
(global-set-key (kbd <span style="font-style: italic;">"C-c a"</span>) 'org-agenda)
(global-set-key (kbd <span style="font-style: italic;">"C-c c"</span>) 'org-capture)

</pre>
</div>
</div>
</div>
<div id="outline-container-org58b20e0" class="outline-3">
<h3 id="org58b20e0">Org capture templates</h3>
<div class="outline-text-3" id="text-org58b20e0">
<p>
A few templates I use which work well with org-gcal
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="font-weight: bold;">setq</span> org-capture-templates
      '((<span style="font-style: italic;">"t"</span> <span style="font-style: italic;">"Todo"</span> entry (file <span style="font-style: italic;">"/mnt/c/Home/OrgAgenda/Tasks.org"</span>)
         <span style="font-style: italic;">"* TODO %^{Task}\n:PROPERTIES:\n:END:\n:org-gcal:\nSCHEDULED: %^{When to do}t\n:END:"</span>)

        (<span style="font-style: italic;">"e"</span> <span style="font-style: italic;">"Event"</span> entry (file <span style="font-style: italic;">"/mnt/c/Home/OrgAgenda/Events.org"</span>)
         <span style="font-style: italic;">"* %^{Event name}\n :PROPERTIES:\n:END:\n:org-gcal:\n%^{When}t\n:END:"</span>)

      (<span style="font-style: italic;">"h"</span> <span style="font-style: italic;">"Homework"</span> entry (file <span style="font-style: italic;">"/mnt/c/Home/OrgAgenda/Homework.org"</span>)
         <span style="font-style: italic;">"* %^{Description} - %^{Class|Creative Design |Analysis of Algorithims |Computer Architecture |Linear Algebra|199 Seminar }\n :PROPERTIES:\n:END:\n:org-gcal:\nSCHEDULED: %^{Due Date}t \n:END:"</span>)))

</pre>
</div>
</div>
</div>
