content/README.org
** Org-bullets
   #+begin_src emacs-lisp

  
(use-package org-bullets
  :ensure t
  :hook (org-mode . org-bullets-mode)
  :custom (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))


   #+end_src
** Org Roam
   
*** Initial package
    #+begin_src emacs-lisp


            (use-package org-roam
              :ensure t
              :init
              (setq org-roam-v2-ack t)
              :custom
              (org-roam-directory "/mnt/c/Home/roamnotes")
              (org-roam-completion-everywhere t)
              (org-roam-capture-templates




            ;; templates



               '(("d" "default" plain
                  "%?"
                  :if-new (file+head "%<%y%m%d%h%m%s>-${slug}.org" "#+title: ${title}\n")
                  :unnarrowed t)

               ("l" "programming language" plain
                "* characteristics\n\n- family: \n- inspired by: \n\n* reference:\n* examples:%?"
                :if-new (file+head "%<%y%m%d%h%m%s>-${slug}.org" "#+title: ${title}\n")
                :unnarrowed t)

               ("b" "book notes" plain
                "\n* source\n\nauthor: %^{author}\ntitle: ${title}\nyear: %^{year}\n\n* summary\n\n%?"
                :if-new (file+head "%<%y%m%d%h%m%s>-${slug}.org" "#+title: ${title}\n")
                :unnarrowed t)

              ("h" "homework" entry (file+headline "/mnt/c/Home/orgagenda/homework.org" "homework")
            "* %? %^l %^g \n%t" :prepend t)
            ("w" "work" entry (file+headline "/mnt/c/Home/orgagenda/work.org" "work at mtss")
            "* %?\n%t" :prepend t)
            ("t" "to do item" entry (file+headline "/mnt/c/Home/orgagenda/i.org" "to do")
            "* todo %?\n%u" :prepend t)))


      ; capture templates
	
                ;; bindings


              :bind (("C-c n l" . org-roam-buffer-toggle)
                     ("C-c n f" . org-roam-node-find)
                     ("C-c n i" . org-roam-node-insert)
                     :map org-mode-map
                     ("C-S-i" . completion-at-point))
              :config
              (org-roam-setup))


    #+end_src 
** Org Babel
   For setting up how emacs code block are evaluated and which can be evaulated. [[https://magit.vc/manual/magit/Stashing.html][magit]]
   #+begin_src emacs-lisp

          (with-eval-after-load 'org
            (org-babel-do-load-languages
                'org-babel-load-languages
                '((emacs-lisp . t)
                (python . t) (C . t)  (octave . t)))

            (push '("conf-unix" . conf-unix) org-src-lang-modes))
     ; This makes sure no prompt sets up when we evaulute a src block
     (setq org-confirm-babel-evaluate nil)

   #+end_src
*** Structure Templates
    These let you use org temp and set custom auto completes for source blocks.
    #+begin_src emacs-lisp

                  (with-eval-after-load 'org
                    ;; This is needed as of Org 9.2
                    (require 'org-tempo)

                    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
                    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
                    (add-to-list 'org-structure-template-alist '("py" . "src python"))
            (add-to-list 'org-structure-template-alist '("cde" . "src C"))

            (add-to-list 'org-structure-template-alist '("oct" . "src octave")))

    #+end_src
    
** Org gcal
   #+begin_src emacs-lisp


(use-package org-gcal
:ensure t
:config
(setq org-gcal-client-id "565757381996-82kv17k44fr3k3tdr0vr79n6uo33ogi1.apps.googleusercontent.com"
      org-gcal-client-secret "4GD3d_7JixM1E8U3w5xFdpgI"
      org-gcal-file-alist '(("c1auvuocuvj0lst62i4mv5eme0@group.calendar.google.com" . "/mnt/c/Home/OrgAgenda/Tasks.org")
			    ("c1auvuocuvj0lst62i4mv5eme0@group.calendar.google.com" . "/mnt/c/Home/OrgAgenda/Homework.org"))))

; semi autammaticaly syncs these 2 to org calander
(add-hook 'org-agenda-mode-hook (lambda () (org-gcal-sync) ))
(add-hook 'org-capture-after-finalize-hook (lambda () (org-gcal-sync) ))


   #+end_src
   
* TODO MatLab
Lisp for running matlab in its own shell
** Mode
#+begin_src emacs-lisp

    ; (add-to-list 'load-path "~/.matlab-mode")
    ; (load-library "matlab-load")

#+end_src
* Terminals

Term mode doesnt work on windows.  term mode works best with GNU systems.  Im currently using it on WSL2.  Term mode uses elisp language to run the terminal which is why it is fairly slow.

