public/README.html
<div id="outline-container-org5741608" class="outline-3">
<h3 id="org5741608">Org-bullets</h3>
<div class="outline-text-3" id="text-org5741608">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

(use-package org-bullets
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:hook</span> (org-mode . org-bullets-mode)
  <span style="font-weight: bold;">:custom</span> (org-bullets-bullet-list '(<span style="font-style: italic;">"&#9673;"</span> <span style="font-style: italic;">"&#9675;"</span> <span style="font-style: italic;">"&#9679;"</span> <span style="font-style: italic;">"&#9675;"</span> <span style="font-style: italic;">"&#9679;"</span> <span style="font-style: italic;">"&#9675;"</span> <span style="font-style: italic;">"&#9679;"</span>)))


</pre>
</div>
</div>
</div>
<div id="outline-container-org6ab1906" class="outline-3">
<h3 id="org6ab1906">Org Roam</h3>
<div class="outline-text-3" id="text-org6ab1906">
</div>
<div id="outline-container-org1301583" class="outline-4">
<h4 id="org1301583">Initial package</h4>
<div class="outline-text-4" id="text-org1301583">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

      (use-package org-roam
        <span style="font-weight: bold;">:ensure</span> t
        <span style="font-weight: bold;">:init</span>
        (<span style="font-weight: bold;">setq</span> org-roam-v2-ack t)
        <span style="font-weight: bold;">:custom</span>
        (org-roam-directory <span style="font-style: italic;">"/mnt/c/Home/roamnotes"</span>)
        (org-roam-completion-everywhere t)
        (org-roam-capture-templates




      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">templates</span>



         '((<span style="font-style: italic;">"d"</span> <span style="font-style: italic;">"default"</span> plain
            <span style="font-style: italic;">"%?"</span>
            <span style="font-weight: bold;">:if-new</span> (file+head <span style="font-style: italic;">"%&lt;%y%m%d%h%m%s&gt;-${slug}.org"</span> <span style="font-style: italic;">"#+title: ${title}\n"</span>)
            <span style="font-weight: bold;">:unnarrowed</span> t)

         (<span style="font-style: italic;">"l"</span> <span style="font-style: italic;">"programming language"</span> plain
          <span style="font-style: italic;">"* characteristics\n\n- family: \n- inspired by: \n\n* reference:\n* examples:%?"</span>
          <span style="font-weight: bold;">:if-new</span> (file+head <span style="font-style: italic;">"%&lt;%y%m%d%h%m%s&gt;-${slug}.org"</span> <span style="font-style: italic;">"#+title: ${title}\n"</span>)
          <span style="font-weight: bold;">:unnarrowed</span> t)

         (<span style="font-style: italic;">"b"</span> <span style="font-style: italic;">"book notes"</span> plain
          <span style="font-style: italic;">"\n* source\n\nauthor: %^{author}\ntitle: ${title}\nyear: %^{year}\n\n* summary\n\n%?"</span>
          <span style="font-weight: bold;">:if-new</span> (file+head <span style="font-style: italic;">"%&lt;%y%m%d%h%m%s&gt;-${slug}.org"</span> <span style="font-style: italic;">"#+title: ${title}\n"</span>)
          <span style="font-weight: bold;">:unnarrowed</span> t)

        (<span style="font-style: italic;">"h"</span> <span style="font-style: italic;">"homework"</span> entry (file+headline <span style="font-style: italic;">"/mnt/c/Home/orgagenda/homework.org"</span> <span style="font-style: italic;">"homework"</span>)
      <span style="font-style: italic;">"* %? %^l %^g \n%t"</span> <span style="font-weight: bold;">:prepend</span> t)
      (<span style="font-style: italic;">"w"</span> <span style="font-style: italic;">"work"</span> entry (file+headline <span style="font-style: italic;">"/mnt/c/Home/orgagenda/work.org"</span> <span style="font-style: italic;">"work at mtss"</span>)
      <span style="font-style: italic;">"* %?\n%t"</span> <span style="font-weight: bold;">:prepend</span> t)
      (<span style="font-style: italic;">"t"</span> <span style="font-style: italic;">"to do item"</span> entry (file+headline <span style="font-style: italic;">"/mnt/c/Home/orgagenda/i.org"</span> <span style="font-style: italic;">"to do"</span>)
      <span style="font-style: italic;">"* todo %?\n%u"</span> <span style="font-weight: bold;">:prepend</span> t)))


<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">capture templates</span>

          <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">bindings</span>


        <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-c n l"</span> . org-roam-buffer-toggle)
               (<span style="font-style: italic;">"C-c n f"</span> . org-roam-node-find)
               (<span style="font-style: italic;">"C-c n i"</span> . org-roam-node-insert)
               <span style="font-weight: bold;">:map</span> org-mode-map
               (<span style="font-style: italic;">"C-S-i"</span> . completion-at-point))
        <span style="font-weight: bold;">:config</span>
        (org-roam-setup))


</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf7d9253" class="outline-3">
<h3 id="orgf7d9253">Org Babel</h3>
<div class="outline-text-3" id="text-orgf7d9253">
<p>
For setting up how emacs code block are evaluated and which can be evaulated. <a href="https://magit.vc/manual/magit/Stashing.html">magit</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">
     (<span style="font-weight: bold;">with-eval-after-load</span> 'org
       (org-babel-do-load-languages
           'org-babel-load-languages
           '((emacs-lisp . t)
           (python . t) (C . t)  (octave . t)))

       (<span style="font-weight: bold;">push</span> '(<span style="font-style: italic;">"conf-unix"</span> . conf-unix) org-src-lang-modes))
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">This makes sure no prompt sets up when we evaulute a src block</span>
(<span style="font-weight: bold;">setq</span> org-confirm-babel-evaluate nil)

</pre>
</div>
</div>
<div id="outline-container-orgbe3dcf8" class="outline-4">
<h4 id="orgbe3dcf8">Structure Templates</h4>
<div class="outline-text-4" id="text-orgbe3dcf8">
<p>
These let you use org temp and set custom auto completes for source blocks.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">
      (<span style="font-weight: bold;">with-eval-after-load</span> 'org
        <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">This is needed as of Org 9.2</span>
        (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">org-tempo</span>)

        (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"sh"</span> . <span style="font-style: italic;">"src shell"</span>))
        (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"el"</span> . <span style="font-style: italic;">"src emacs-lisp"</span>))
        (add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"py"</span> . <span style="font-style: italic;">"src python"</span>))
(add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"cde"</span> . <span style="font-style: italic;">"src C"</span>))

(add-to-list 'org-structure-template-alist '(<span style="font-style: italic;">"oct"</span> . <span style="font-style: italic;">"src octave"</span>)))

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2b879c4" class="outline-3">
<h3 id="org2b879c4">Org gcal</h3>
<div class="outline-text-3" id="text-org2b879c4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

(use-package org-gcal
<span style="font-weight: bold;">:ensure</span> t
<span style="font-weight: bold;">:config</span>
(<span style="font-weight: bold;">setq</span> org-gcal-client-id <span style="font-style: italic;">"565757381996-82kv17k44fr3k3tdr0vr79n6uo33ogi1.apps.googleusercontent.com"</span>
      org-gcal-client-secret <span style="font-style: italic;">"4GD3d_7JixM1E8U3w5xFdpgI"</span>
      org-gcal-file-alist '((<span style="font-style: italic;">"c1auvuocuvj0lst62i4mv5eme0@group.calendar.google.com"</span> . <span style="font-style: italic;">"/mnt/c/Home/OrgAgenda/Tasks.org"</span>)
                            (<span style="font-style: italic;">"c1auvuocuvj0lst62i4mv5eme0@group.calendar.google.com"</span> . <span style="font-style: italic;">"/mnt/c/Home/OrgAgenda/Homework.org"</span>))))

<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">semi autammaticaly syncs these 2 to org calander</span>
(add-hook 'org-agenda-mode-hook (<span style="font-weight: bold;">lambda</span> () (org-gcal-sync) ))
(add-hook 'org-capture-after-finalize-hook (<span style="font-weight: bold;">lambda</span> () (org-gcal-sync) ))


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org95ed927" class="outline-2">
<h2 id="org95ed927"><span class="todo TODO">TODO</span> MatLab</h2>
<div class="outline-text-2" id="text-org95ed927">
<p>
Lisp for running matlab in its own shell
</p>
</div>
<div id="outline-container-orgd060ea6" class="outline-3">
<h3 id="orgd060ea6">Mode</h3>
<div class="outline-text-3" id="text-orgd060ea6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">(add-to-list 'load-path "~/.matlab-mode")</span>
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">(load-library "matlab-load")</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org04b9691" class="outline-2">
<h2 id="org04b9691">Terminals</h2>
<div class="outline-text-2" id="text-org04b9691">
<p>
Term mode doesnt work on windows.  term mode works best with GNU systems.  Im currently using it on WSL2.  Term mode uses elisp language to run the terminal which is why it is fairly slow.
</p>
</div>
