content/README.org
** term
Term mode needs to be quir with C-d before using normal functions

C-c C-k for char mode which diables emacs inpu
C-c C-j for line modw hich enables it

#+begin_src emacs-lisp


    (use-package term
      :ensure t
    :config
      (setq explicit-shell-file-name "bash")
  ; term-promp-regexp looks for a typical bash prompt and jumps to the last promp
  
      (setq term-prompt-regexp "^[^#$%>\n]*[#$%] *")
    )

#+end_src

*** term-mode color

Gives term mode better colors or complete access to linux terminals color pallete

#+begin_src emacs-lisp

  (use-package eterm-256color

    :ensure t
    :hook (term-mode . eterm-256color-mode)

    )

#+end_src

** Ansi term

Ansii term allows you to open multiple term buffers.  Without term would default to open buffer unless you name the buffer uniquely.

** Vterm

Need libtool-bin, libtool, and  cmake, and other dependencies see Vterm documentation.  This is what I needed on Ubuntu

Vterm is faster as its wriiten in C while term is in lisp

#+begin_src emacs-lisp


  (use-package vterm
  :ensure t
    :commands vterm
    :config
    ;;(setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")  ;; Set this to match your custom shell prompt
    ;;(setq vterm-shell "zsh")                       ;; Set this to customize the shell to launch
    (setq vterm-max-scrollback 10000))

#+end_src

** eshell

type use-theme into eshell to see all the possible themes

#+begin_src emacs-lisp
  (use-package eshell-git-prompt
    :ensure t)

  (use-package eshell
  :hook (eshell-first-time-mode . efs/configure-eshell)
    :config
    (eshell-git-prompt-use-theme 'powerline)

    )


#+end_src

*** Eshell configuring
To much buffer length slows down performance. so line [[(max-buf-lines)]] stores the max amount of lines in a buffer.  Also on line [[(input-scroll)]]

#+begin_src emacs-lisp


  (defun efs/configure-eshell ()
    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    (setq eshell-history-size         10000
          eshell-buffer-maximum-lines 10000  ;		    (ref:max-buf-lines)
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t)) 	;	     (ref:input-scroll)

#+end_src

You can pipe in eshell to a buffer

#+begin_src shell

echo "hello" > #<buffer buffer-name>

#+end_src

* website-publishing

** local host
#+begin_src emacs-lisp

    (use-package simple-httpd
      :ensure t)

#+end_src

