public/README.html

<div id="outline-container-orgbf614b3" class="outline-3">
<h3 id="orgbf614b3">term</h3>
<div class="outline-text-3" id="text-orgbf614b3">
<p>
Term mode needs to be quir with C-d before using normal functions
</p>

<p>
C-c C-k for char mode which diables emacs inpu
C-c C-j for line modw hich enables it
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">

  (use-package term
    <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
    (<span style="font-weight: bold;">setq</span> explicit-shell-file-name <span style="font-style: italic;">"bash"</span>)
<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">term-promp-regexp looks for a typical bash prompt and jumps to the last promp</span>

    (<span style="font-weight: bold;">setq</span> term-prompt-regexp <span style="font-style: italic;">"^[</span><span style="font-style: italic;">^</span><span style="font-style: italic;">#$%&gt;\n]*[#$%] *"</span>)
  )

</pre>
</div>
</div>

<div id="outline-container-org9c6f207" class="outline-4">
<h4 id="org9c6f207">term-mode color</h4>
<div class="outline-text-4" id="text-org9c6f207">
<p>
Gives term mode better colors or complete access to linux terminals color pallete
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package eterm-256color

  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:hook</span> (term-mode . eterm-256color-mode)

  )

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgac95e6d" class="outline-3">
<h3 id="orgac95e6d">Ansi term</h3>
<div class="outline-text-3" id="text-orgac95e6d">
<p>
Ansii term allows you to open multiple term buffers.  Without term would default to open buffer unless you name the buffer uniquely.
</p>
</div>
</div>

<div id="outline-container-org2165bef" class="outline-3">
<h3 id="org2165bef">Vterm</h3>
<div class="outline-text-3" id="text-org2165bef">
<p>
Need libtool-bin, libtool, and  cmake, and other dependencies see Vterm documentation.  This is what I needed on Ubuntu
</p>

<p>
Vterm is faster as its wriiten in C while term is in lisp
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">

(use-package vterm
<span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:commands</span> vterm
  <span style="font-weight: bold;">:config</span>
  <span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(setq term-prompt-regexp "^[</span><span style="font-weight: bold; font-style: italic;">^</span><span style="font-weight: bold; font-style: italic;">#$%&gt;\n]*[#$%&gt;] *")  ;; Set this to match your custom shell prompt</span>
  <span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(setq vterm-shell "zsh")                       ;; Set this to customize the shell to launch</span>
  (<span style="font-weight: bold;">setq</span> vterm-max-scrollback 10000))

</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd30d55" class="outline-3">
<h3 id="orgbd30d55">eshell</h3>
<div class="outline-text-3" id="text-orgbd30d55">
<p>
type use-theme into eshell to see all the possible themes
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package eshell-git-prompt
  <span style="font-weight: bold;">:ensure</span> t)

(use-package eshell
<span style="font-weight: bold;">:hook</span> (eshell-first-time-mode . efs/configure-eshell)
  <span style="font-weight: bold;">:config</span>
  (eshell-git-prompt-use-theme 'powerline)

  )


</pre>
</div>
</div>

<div id="outline-container-orgc8e04ea" class="outline-4">
<h4 id="orgc8e04ea">Eshell configuring</h4>
<div class="outline-text-4" id="text-orgc8e04ea">
<p>
To much buffer length slows down performance. so line <a href="#coderef-max-buf-lines" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-max-buf-lines');" onmouseout="CodeHighlightOff(this, 'coderef-max-buf-lines');">max-buf-lines</a> stores the max amount of lines in a buffer.  Also on line <a href="#coderef-input-scroll" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-input-scroll');" onmouseout="CodeHighlightOff(this, 'coderef-input-scroll');">input-scroll</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">efs/configure-eshell</span> ()
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Save command history when commands are entered</span>
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Truncate buffer for performance</span>
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  (<span style="font-weight: bold;">setq</span> eshell-history-size         10000
<span id="coderef-max-buf-lines" class="coderef-off">        eshell-buffer-maximum-lines 10000  <span style="font-weight: bold; font-style: italic;">;</span> (max-buf-lines)</span>
        eshell-hist-ignoredups t
<span id="coderef-input-scroll" class="coderef-off">        eshell-scroll-to-bottom-on-input t))    <span style="font-weight: bold; font-style: italic;">;</span> (input-scroll)</span>

</pre>
</div>

<p>
You can pipe in eshell to a buffer
</p>

<div class="org-src-container">
<pre class="src src-shell">
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"hello"</span> &gt; <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">&lt;buffer buffer-name&gt;</span>

</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org46ead44" class="outline-2">
<h2 id="org46ead44">website-publishing</h2>
<div class="outline-text-2" id="text-org46ead44">
</div>
<div id="outline-container-orgca1d537" class="outline-3">
<h3 id="orgca1d537">local host</h3>
<div class="outline-text-3" id="text-orgca1d537">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package simple-httpd
  <span style="font-weight: bold;">:ensure</span> t)

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.2 (<a href="https://orgmode.org">Org</a> mode 9.4.4)</p>
</div>
</body>
</html>
